georgik/OpenTyrian/sdkconfig.defaults.esp-box-3
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.0 Project Minimal Configuration
#

# Board selection
CONFIG_SDL_BSP_ESP_BOX_3=y

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_esp32s3_16mb.csv"

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# Required for TTF rendering if it happens in main task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32000

# Critical debug setting for development
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# OpenTyrian Configuration for ESP-Box-3 (320x240 display)
CONFIG_OPENTYRIAN_SCALE_AUTO=y
CONFIG_OPENTYRIAN_SCALE_FACTOR_INT=1
CONFIG_OPENTYRIAN_ENABLE_HARDWARE_ACCELERATION=n

